## 8. 데이터 로딩과 저장

In [1]:
import numpy as np
import pandas as pd

In [1]:
!dir examples

 C 드라이브의 볼륨에는 이름이 없습니다.
 볼륨 일련 번호: 9EDB-2F2E

 C:\Users\jwnam\Documents\인공지능 25기\Data Analysis\examples 디렉터리

2022-11-21  오전 10:18    <DIR>          .
2022-11-21  오전 10:18    <DIR>          ..
2019-02-17  오전 12:37                58 ex1.csv
2019-02-17  오전 12:37                42 ex2.csv
2019-02-17  오후 05:37               170 ex3.txt
               3개 파일                 270 바이트
               2개 디렉터리  92,193,755,136 바이트 남음

In [6]:
df = pd.read_csv('./examples/ex1.csv')

In [7]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [9]:
df.columns

Index(['a', 'b', 'c', 'd', 'message'], dtype='object')

In [13]:
df = pd.read_table('./examples/ex1.csv', sep=',')
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [18]:
pd.read_csv('./examples/ex2.csv', header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [19]:
pd.read_csv('./examples/ex2.csv', names=['a', 'b', 'c', 'message'])

    a   b   c message
1   2   3   4   hello
5   6   7   8   world
9  10  11  12     foo

In [20]:
names = ['a', 'b', 'c', 'message']

In [21]:
pd.read_csv('./examples/ex2.csv', names=names)

    a   b   c message
1   2   3   4   hello
5   6   7   8   world
9  10  11  12     foo

In [24]:
names = ['a', 'b', 'c', 'message']
df = pd.read_csv('./examples/ex2.csv', names=names, index_col=4)
df

       a   b   c  message
hello  1   2   3        4
world  5   6   7        8
foo    9  10  11       12

In [26]:
pd.read_table('./examples/ex3.txt', sep='\s+') # \s+ : 정규표현식, 공백 1개 이상의 패턴과 매치

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [2]:
df = pd.read_csv('./examples/ex1.csv')
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [6]:
df.to_csv("./examples/out.csv")

## 9. 데이터 정제 및 준비

### 9.1 누락된 데이터 처리하기

- 결측치 골라내기

In [8]:
type(np.nan)

float

In [9]:
string_data = ['abc', 'def', np.nan, 'hid']
string_data

['abc', 'def', nan, 'hid']

In [10]:
pd.isnull(string_data)

array([False, False,  True, False])

In [11]:
type(None)

NoneType

In [14]:
string_data = pd.Series(['abc', 'def', None, 'hit'])
string_data

0     abc
1     def
2    None
3     hit
dtype: object

In [15]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [17]:
data = pd.Series([1, np.nan, 3.5, np.nan, 6])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    6.0
dtype: float64

In [20]:
data.isnull()

0    False
1     True
2    False
3     True
4    False
dtype: bool

In [22]:
data[data.isnull()]

1   NaN
3   NaN
dtype: float64

In [ ]:
data.drop([1,3])

In [ ]:
# null 인 행을 삭제하고 싶다면 null인 행의 인덱스를 구해서 drop 함수에 적용

In [25]:
null_idx = data[data.isnull()].index
data.drop(null_idx)

0    1.0
2    3.5
4    6.0
dtype: float64

In [27]:
# dropna를 사용하면 null인 행을 삭제
data.dropna()

0    1.0
2    3.5
4    6.0
dtype: float64

In [28]:
data = pd.DataFrame([[1.0, 6.5, 3.0],
                     [1.0, np.nan, np.nan],
                     [np.nan, np.nan, np.nan],
                     [np.nan, 6.0, 3.0]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.0  3.0

In [29]:
data.dropna() 
# dropna 는 기본값으로 axis=0, how='any' 설정되어 있으므로 null이 하나라도 존재하는 행을 삭제

     0    1    2
0  1.0  6.5  3.0

In [30]:
data.dropna(axis=0, how='all') # 행을 삭제하되, 그 행의 모든값이 null 일때만 삭제

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.0  3.0

In [32]:
data[100] = np.nan # 100이라는 행 추가 (nan)
data

   0    1    2    100
0  1.0  6.5  3.0  NaN
1  1.0  NaN  NaN  NaN
2  NaN  NaN  NaN  NaN
3  NaN  6.0  3.0  NaN

In [33]:
data.dropna(axis=1, how='all') #axis=1이면 열을 삭제하되 모든값이 null일 경우 삭제

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.0  3.0

In [34]:
data.dropna(axis=1, how='any')

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [36]:
df = pd.DataFrame(np.random.randn(7,3))
df

          0         1         2
0  0.205704 -1.537738 -0.045895
1  1.273995 -0.586770  1.891855
2 -0.706104 -0.736094 -0.123172
3 -1.324841  2.369293  1.115743
4 -0.879613  1.014675  0.032784
5 -0.741489 -0.235411  0.527214
6  0.896484 -0.167694 -0.442478

In [38]:
df[1]

0   -1.537738
1   -0.586770
2   -0.736094
3    2.369293
4    1.014675
5   -0.235411
6   -0.167694
Name: 1, dtype: float64

In [41]:
df.iloc[0:4, 1] = np.nan
df.iloc[0:2, 2] = np.nan
df

          0         1         2
0  0.205704       NaN       NaN
1  1.273995       NaN       NaN
2 -0.706104       NaN -0.123172
3 -1.324841       NaN  1.115743
4 -0.879613  1.014675  0.032784
5 -0.741489 -0.235411  0.527214
6  0.896484 -0.167694 -0.442478

In [42]:
df.dropna()

          0         1         2
4 -0.879613  1.014675  0.032784
5 -0.741489 -0.235411  0.527214
6  0.896484 -0.167694 -0.442478

In [43]:
df.dropna(axis=1)

          0
0  0.205704
1  1.273995
2 -0.706104
3 -1.324841
4 -0.879613
5 -0.741489
6  0.896484

In [44]:
df.dropna(axis=1, thresh=5) # thresh=5 : 열에 null이 아닌 데이터가 5개보다 미만이면 삭제

          0         2
0  0.205704       NaN
1  1.273995       NaN
2 -0.706104 -0.123172
3 -1.324841  1.115743
4 -0.879613  0.032784
5 -0.741489  0.527214
6  0.896484 -0.442478

- 결측치 채우기

In [45]:
df

          0         1         2
0  0.205704       NaN       NaN
1  1.273995       NaN       NaN
2 -0.706104       NaN -0.123172
3 -1.324841       NaN  1.115743
4 -0.879613  1.014675  0.032784
5 -0.741489 -0.235411  0.527214
6  0.896484 -0.167694 -0.442478

In [46]:
df.fillna(0) # 일괄 0으로 대체

          0         1         2
0  0.205704  0.000000  0.000000
1  1.273995  0.000000  0.000000
2 -0.706104  0.000000 -0.123172
3 -1.324841  0.000000  1.115743
4 -0.879613  1.014675  0.032784
5 -0.741489 -0.235411  0.527214
6  0.896484 -0.167694 -0.442478

In [50]:
df.fillna({1:0, 2:0.5}, inplace=True) # 열을 지정해서 대체
df

          0         1         2
0  0.205704  0.000000  0.500000
1  1.273995  0.000000  0.500000
2 -0.706104  0.000000 -0.123172
3 -1.324841  0.000000  1.115743
4 -0.879613  1.014675  0.032784
5 -0.741489 -0.235411  0.527214
6  0.896484 -0.167694 -0.442478

In [53]:
df = pd.DataFrame(np.random.randn(6,3))
df

          0         1         2
0  0.798376 -0.970401  1.305493
1 -0.429151  0.645953 -0.338069
2 -1.500952  0.264969 -1.390318
3  1.458141  0.168219 -1.340143
4 -0.147374  0.102036 -0.163195
5 -0.992495  1.168341 -1.495690

In [55]:
df.iloc[2:, 1] = np.nan

In [58]:
df.iloc[4:, 2] = np.nan
df

          0         1         2
0  0.798376 -0.970401  1.305493
1 -0.429151  0.645953 -0.338069
2 -1.500952       NaN -1.390318
3  1.458141       NaN -1.340143
4 -0.147374       NaN       NaN
5 -0.992495       NaN       NaN

In [59]:
df.fillna(axis=0, method='ffill') # axis=0 이므로 행 축을 따라서 채워넣는다

          0         1         2
0  0.798376 -0.970401  1.305493
1 -0.429151  0.645953 -0.338069
2 -1.500952  0.645953 -1.390318
3  1.458141  0.645953 -1.340143
4 -0.147374  0.645953 -1.340143
5 -0.992495  0.645953 -1.340143

In [60]:
df.fillna(axis=1, method='ffill') # axis=0 이므로 행 축을 따라서 채워넣는다

          0         1         2
0  0.798376 -0.970401  1.305493
1 -0.429151  0.645953 -0.338069
2 -1.500952 -1.500952 -1.390318
3  1.458141  1.458141 -1.340143
4 -0.147374 -0.147374 -0.147374
5 -0.992495 -0.992495 -0.992495

In [61]:
df.fillna(axis=0, method='ffill', limit=2)

          0         1         2
0  0.798376 -0.970401  1.305493
1 -0.429151  0.645953 -0.338069
2 -1.500952  0.645953 -1.390318
3  1.458141  0.645953 -1.340143
4 -0.147374       NaN -1.340143
5 -0.992495       NaN -1.340143

In [62]:
m = df.mean(axis=0).mean()
df.fillna(m)

          0         1         2
0  0.798376 -0.970401  1.305493
1 -0.429151  0.645953 -0.338069
2 -1.500952 -0.246186 -1.390318
3  1.458141 -0.246186 -1.340143
4 -0.147374 -0.246186 -0.246186
5 -0.992495 -0.246186 -0.246186

In [63]:
df

          0         1         2
0  0.798376 -0.970401  1.305493
1 -0.429151  0.645953 -0.338069
2 -1.500952       NaN -1.390318
3  1.458141       NaN -1.340143
4 -0.147374       NaN       NaN
5 -0.992495       NaN       NaN

### 9.2 데이터 변형

In [72]:
data = pd.DataFrame({'k1':['one', 'two']*3 + ['two'],
             'k2':[1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [73]:
# 중복인지 체크
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [74]:
data.duplicated(keep='first')

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [75]:
# k1 컬럼 기준으로 중복 체크
data.duplicated(['k1'])

0    False
1    False
2     True
3     True
4     True
5     True
6     True
dtype: bool

In [76]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [77]:
data.drop_duplicates(['k1'])

    k1  k2
0  one   1
1  two   1

In [78]:
# keep=last 뒤에 열 기준 삭제
data.duplicated(['k1'], keep='last') # 삭제 전 확인
data.drop_duplicates(['k1'], keep='last')

    k1  k2
4  one   3
6  two   4

- 중복 제거하기

In [ ]:
# keep=last 뒤에 열 기준 삭제
data.duplicated(['k1'], keep='last') # 삭제 전 확인
data.drop_duplicates(['k1'], keep='last')

In [79]:
data['v1'] = range(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [81]:
data.drop_duplicates()

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [83]:
data.drop_duplicates(['k1', 'k2'])

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5

- 값 치환하기

In [84]:
data = pd.Series([1, -999, 2, -999, -1000, 3])
data

0       1
1    -999
2       2
3    -999
4   -1000
5       3
dtype: int64

In [85]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [88]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [89]:
data.replace({-999 : np.nan, -1000 : 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

- 축 색인 이름 바꾸기

In [107]:
data = pd.DataFrame(np.arange(12).reshape(3,4),
            index=['Ohio', 'Colorado', 'New York'],
            columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [91]:
data.index

Index(['ohio', 'Colorado', 'New York'], dtype='object')

In [94]:
def upperCase(x):
    return x.upper()

data.index.map(upperCase)

Index(['OHIO', 'COLORADO', 'NEW YORK'], dtype='object')

In [96]:
data.index.map(lambda x:x.upper())

Index(['OHIO', 'COLORADO', 'NEW YORK'], dtype='object')

In [114]:
data.rename(index={'Ohio' : 'Texas'})

          one  two  three  four
Texas       0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [115]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [118]:
data.index.map(lambda x:x.upper())

Index(['OHIO', 'COLORADO', 'NEW YORK'], dtype='object')

In [2]:
data = pd.DataFrame(np.arange(12).reshape(3, 4),
                   index=['Ohio', 'Colorado', 'New York'],
                   columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [3]:
data.rename(index=str.upper)

          one  two  three  four
OHIO        0    1      2     3
COLORADO    4    5      6     7
NEW YORK    8    9     10    11

In [122]:
'hello'.upper()

'HELLO'

In [6]:
data.rename(columns=str.upper)

          ONE  TWO  THREE  FOUR
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [9]:
data.rename(index=str.lower, columns=str.upper)

          ONE  TWO  THREE  FOUR
ohio        0    1      2     3
colorado    4    5      6     7
new york    8    9     10    11

- 데이터 구간 분할

In [10]:
data = {'Dave':'dave@gmail.com',
        'Steve': 'steve@gmail.com',
        'Rob':'rob@gmail.com',
        'Wes':np.nan,
        'Puppy':'p',
        'Number':'123'}
sr_data= pd.Series(data)        
sr_data

Dave       dave@gmail.com
Steve     steve@gmail.com
Rob         rob@gmail.com
Wes                   NaN
Puppy                   p
Number                123
dtype: object

In [11]:
sr_data.str.isnumeric()

Dave      False
Steve     False
Rob       False
Wes         NaN
Puppy     False
Number     True
dtype: object

In [12]:
# 수치데이터(양적데이터) -> 범주형데이터(질적데이터)
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
ages

[20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [13]:
bins = [18, 25, 35, 60, 100]
cats = pd.cut(ages, bins)

In [14]:
type(cats)

pandas.core.arrays.categorical.Categorical

In [15]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [17]:
bins = [18, 25, 35, 60, 100]
cats = pd.cut(ages, bins, labels=['Youth', 'YoungAdult', 'Midel', 'Senior'])
cats

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'Midel', 'Midel', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'Midel' < 'Senior']

In [18]:
pd.value_counts(cats)

Youth         5
YoungAdult    3
Midel         3
Senior        1
dtype: int64

In [20]:
cats = pd.cut(ages, 4)
pd.value_counts(cats)

(19.959, 30.25]    6
(30.25, 40.5]      3
(40.5, 50.75]      2
(50.75, 61.0]      1
dtype: int64

In [22]:
qcats = pd.qcut(ages, 4)
pd.value_counts(qcats)

(19.999, 22.75]    3
(22.75, 29.0]      3
(29.0, 38.0]       3
(38.0, 61.0]       3
dtype: int64

- 특잇값(바깥값, outlier) 찾고 제외하기

In [24]:
data = pd.DataFrame(np.random.randn(1000, 4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.006763     0.011212    -0.002324     0.000025
std       1.000943     1.002636     1.001032     0.978017
min      -3.438403    -3.584276    -3.235001    -3.087650
25%      -0.652237    -0.685066    -0.720809    -0.691200
50%      -0.010644     0.003233    -0.004726     0.012230
75%       0.641345     0.707824     0.697589     0.663476
max       3.160363     3.022540     3.043463     3.092158

In [ ]:
# 3보다 큰 값을 특이값(outlier)로 간주하고 해당되는 값을 3으로 치환

In [25]:
(data > 3).any(axis=1) # 열 축을 따라서 True 값이 하나라도 있는지 확인

0      False
1      False
2      False
3      False
4      False
       ...
995    False
996    False
997    False
998    False
999    False
Length: 1000, dtype: bool

In [26]:
(data > 3).any(axis=1).sum()

4

In [31]:
data[(data < -3).any(axis=1)]

            0         1         2         3
0   -0.707107 -0.076074 -0.142404 -3.087650
244  0.947983  0.852420 -3.235001 -0.370928
260 -3.438403 -0.348403  1.716537 -1.826055
715 -0.806114 -3.584276  0.226985  0.162267

In [28]:
data[data > 3] = 3

In [30]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.006603     0.011189    -0.002368    -0.000067
std       1.000450     1.002569     1.000900     0.977730
min      -3.438403    -3.584276    -3.235001    -3.087650
25%      -0.652237    -0.685066    -0.720809    -0.691200
50%      -0.010644     0.003233    -0.004726     0.012230
75%       0.641345     0.707824     0.697589     0.663476
max       3.000000     3.000000     3.000000     3.000000

- 더미변수 계산하기(one-hot encoding)

In [40]:
# 존재하면1로 존재하지 않으면 0으로 변환
df = pd.DataFrame({'fruit' : ['apple', 'apple', 'pear', 'peach', 'pear'],
             'data':range(5)})
df

   fruit  data
0  apple     0
1  apple     1
2   pear     2
3  peach     3
4   pear     4

In [37]:
dummies = pd.get_dummies(dt['fruit'], prefix='fruit')
dummies

   fruit_apple  fruit_peach  fruit_pear
0            1            0           0
1            1            0           0
2            0            0           1
3            0            1           0
4            0            0           1

In [41]:
# 원본데이터에다가 원본은 날리고 더미변수를 붙이고싶다
pd.concat([df[['data']], dummies], axis=1)

# df 내 data를 두번 색인하면 2차원으로 변환, concat할 대상을 [] 리스트로 묶고 axis 옵션은 1로

   data  fruit_apple  fruit_peach  fruit_pear
0     0            1            0           0
1     1            1            0           0
2     2            0            0           1
3     3            0            1           0
4     4            0            0           1